# SpatialElementDomainData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementDomainData Class
Members See Also
---
A base class for specific domain requirements for a spatial element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class SpatialElementDomainData : IDisposable
```

Visual Basic
---
```text
Public Class SpatialElementDomainData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SpatialElementDomainData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SpatialElementDomainData Autodesk.Revit.DB.Electrical..::..ElectricalLoadAreaData
# See Also
SpatialElementDomainData Members
Autodesk.Revit.DB Namespace